import type { AnimalShape, Level } from './types';

// 动物枚举
export enum Animals {
  考拉 = 'koala',
  兔子 = 'rabbit',
  刺猬 = 'hedgehog',
  乌龟 = 'turtle',
  鹦鹉 = 'parrot',
  蛇 = 'snake',
  大猩猩 = 'gorilla',
  狗 = 'dog',
  驴 = 'donkey',
  北极熊 = 'polar bear',
  老虎 = 'tiger',
  骆驼 = 'camel',
  大象 = 'elephant',
  恐龙 = 'dinosaurs',
  长颈鹿 = 'giraffe',
}

// prettier-ignore
// 关卡
export const LEVEL_LIST: Level<Animals>[] = [
  {
    level: 1,
    star: 1,
    animals: [Animals.刺猬, Animals.大象],
    size: '6,5',
    shape: [
      '0,0','0,1','0,2','0,3','0,4','0,5',
      '1,0','1,1','1,2','1,3','1,4','1,5',
      '2,0',      '2,2','2,3','2,4','2,5',
      '3,0',      '3,2','3,3','3,4','3,5',
      '4,0',      '4,2','4,3','4,4','4,5',

    ],
    color: '#99CA5F',
  },
  {
    level: 2,
    star: 1,
    animals: [Animals.恐龙, Animals.兔子],
    size: '6,7',
    shape: [
      '0,0','0,1',
      '1,0',
      '2,0','2,1',
      '3,0','3,1','3,2',
      '4,0','4,1','4,2','4,3',
      '5,0','5,1','5,2','5,3','5,4','5,5',
      '6,0',            '6,3',
    ],
    color: '#99CA5F',
  },
  {
    level: 3,
    star: 1,
    animals: [Animals.长颈鹿, Animals.考拉],
    size: '8,4',
    shape: [
                                    '0,5',
                                    '1,5','1,6','1,7',
      '2,0',            '2,3','2,4','2,5',
      '3,0','3,1','3,2','3,3','3,4','3,5','3,6','3,7',
    ],
    color: '#99CA5F',
  },
];

// prettier-ignore
// 动物形状
export const ANIMAL_SHAPE: Record<Animals, AnimalShape> = {
  [Animals.考拉]: {
    name: 'koala',
    size: '1,2',
    shape: [
      '0,0',
      '1,0',
    ],
  },
  [Animals.兔子]: {
    name: 'rabbit',
    size: '2,2',
    shape: [
            '0,1',
      '1,0','1,1',
    ],
  },
  [Animals.刺猬]: {
    name: 'hedgehog',
    size: '2,2',
    shape: [
      '0,0','0,1',
      '1,0','1,1',
    ],
  },
  [Animals.乌龟]: {
    name: 'turtle',
    size: '3,2',
    shape: [
            '0,1','0,2',
      '1,0','1,1','1,2',
    ],
  },
  [Animals.鹦鹉]: {
    name: 'parrot',
    size: '3,4',
    shape: [
            '0,1',
      '1,0','1,1','1,2',
            '2,1',
            '3,1',
    ],
  },
  [Animals.蛇]: {
    name: 'snake',
    size: '4,3',
    shape: [
                  '0,2','0,3',
      '1,0','1,1','1,2',
      '2,0','2,1','2,2',
    ],
  },
  [Animals.大猩猩]: {
    name: 'gorilla',
    size: '3,3',
    shape: [
      '0,0','0,1','0,2',
      '1,0','1,1','1,2',
      '2,0',      '2,2',
    ],
  },
  [Animals.狗]: {
    name: 'dog',
    size: '5,3',
    shape: [
      '0,0','0,1',
            '1,1','1,2','1,3','1,4',
            '2,1',            '2,4',
    ],
  },
  [Animals.驴]: {
    name: 'donkey',
    size: '5,4',
    shape: [
      '0,0','0,1',
            '1,1','1,2','1,3','1,4',
            '2,1',            '2,4',
            '3,1',            '3,4',
    ],
  },
  [Animals.北极熊]: {
    name: 'polar bear',
    size: '4,3',
    shape: [
      '0,0','0,1','0,2','0,3',
      '1,0','1,1','1,2',
      '2,0',      '2,2',
    ],
  },
  [Animals.老虎]: {
    name: 'tiger',
    size: '6,3',
    shape: [
      '0,0','0,1','0,2','0,3','0,4','0,5',
      '1,0','1,1','1,2','1,3','1,4','1,5',
            '2,1',            '2,4',
    ],
  },
  [Animals.骆驼]: {
    name: 'camel',
    size: '5,5',
    shape: [
      '0,0','0,1',      '0,3',
            '1,1','1,2','1,3','1,4',
                  '2,2',      '2,4',
                  '3,2',      '3,4',
                  '4,2',      '4,4',
    ],
  },
  [Animals.大象]: {
    name: 'elephant',
    size: '6,5',
    shape: [
      '0,0','0,1','0,2','0,3','0,4','0,5',
      '1,0','1,1','1,2','1,3','1,4','1,5',
      '2,0',      '2,2','2,3','2,4','2,5',
      '3,0',      '3,2',            '3,5',
      '4,0',      '4,2',            '4,5',
    ],
  },
  [Animals.恐龙]: {
    name: 'dinosaurs',
    size: '6,7',
    shape: [
      '0,0','0,1',
      '1,0',
      '2,0',
      '3,0',
      '4,0','4,1','4,2','4,3',
      '5,0','5,1','5,2','5,3','5,4','5,5',
      '6,0',            '6,3',
    ],
  },
  [Animals.长颈鹿]: {
    name: 'giraffe',
    size: '8,4',
    shape: [
      '0,0','0,1',
      '1,0',
      '2,0',
      '3,0',
      '4,0',
      '5,0','5,1','5,2','5,3',
      '6,0',      '6,2',
      '7,0',      '7,2',
    ],
  },
};
